course3struct.org
#+TITLE: Notes on Coursera, Deep Learning Specification, Structuring Machine Learning Projects, 2020
#+AUTHOR: By Me
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: H:10


* Week 1 Structuring Machine Learning Projects

How best to spend your time on a project? Don't go off into the wrong direction!

** Orthogonalization
   
So much stuff to tune! Good engineers know what to tune. You want to tune only in one dimension for optimal control, e.g. only speed, angle of steering etc. for a car. 

- Fit training set well on cost function
  - Bigger network
  - Adam
  - ...
- Fit dev set well on cost function
  - Regularization
  - Bigger training set
- Fit test set well on cost function
  - Bigger dev set
- Performs well in real world
  - Change dev set or cost function

Andres does not use early stopping. It is not orthogonalized - it affects both training set and dev set performance. 

How to diagnose what's the bottleneck to your system's performance?

** Single Number Evaluation Metric

A single number quickly tells whether we improve trying new things. 

Precision: TP/(FP+TP)
Recall: TP/(FN+TP)

If two classifiers don't agree on both metrics, what do? Maybe use F1 score: 2/(1/P + 1/R) (harmonic mean). This gives you a single number evaluation metric. 

** Satisficing and Optimizing Metrics

If you have some metrics, it might be hard to press them into one single number. What helps is to have satisficing metrics, i.e. binary yes/no, only accept yes, and optimizing metrics, from which you pick the best one.

Example: trigger words for voice activation, e.g. hey google. Maximize accuracy (optimizing), in case you have at most 1 false positive every 24 hours (satisficing)

** Train/dev/test Distribution

dev set is sometimes also called cross validation set. 

Suppose you have data from:
- US
- UK
- Europe
- South America
- India
- ...

Have dev and test set from the same distribution! That is, do not divide by region. Instead, randomly shuffle data first and then divide.

** Size of Dev and Test Set

Old way: 70/30 Train/Test, 60/20/20 Train/Dev/Test

T'was pretty reasonable back in ye olden days with up to 10,000 training examples! But in the modern era, you have so much more training data. So you might 98/1/1 train/dev/test. 

Set you test set big enough to give high confidence in the overall performance of your system. The dev set should not be your test set! 

Train set: Learn parameters, dev set: Learn Hyperparameters, test set: Evaluate!

** When to Change dev/test sets and Metrics

Metric: Classification Error

Algorithm A: 3% Error, but shows pornographic images!
Algorithm B: 5% Error

$$ E = \frac{1}{m_{dev}} \sum^{m_{dev}}_{i=1} \mathcal{I}\{y^{(i)}_{pred} \not= y^{(i)}\} $$

doesn't cut it! Add weights $w$:
$$w = \begin{cases}1: & x^{(i)} \text{ is non-porn } \\ 10: & x^{(i)} \text{ if non-porn}\end{cases}$$
And use instead:
$$ E = \frac{1}{\sum_i w^{(i)}} \frac{1}{m_{dev}} \sum^{m_{dev}}_{i=1} w^{(i)} \mathcal{I}\{y^{(i)}_{pred} \not= y^{(i)}\} $$

Two distinct steps:
1. Define a metric to evaluate classifiers (Place target)
2. How to do well on this metric (Aim and shoot at target)

Two completely separate problems!

Sometimes the real world application is nothing like your test/dev sets (e.g. user provided images) 

** Why Human-level Performance?

In some areas, machines can compete with humans. Accuracy can surpass human level performance and asymptotically increase towards Bayes optimal error. Often, progress is quite fast until it hits human level performance. After that, progress slows down significantly. 

So long as ML is worse than humans, you can:
- Get labeled data from humans
- Gain insight from manual error analysis: why did a person get this right?
- better analysis of bias/variance

** Avoidable Bias

Human level performance as a proxy Bayes optimal.

Large training error (compared to human error): Focus on reducing bias.  
Low training error (compared to human error), but larger dev error: Focus on reducing variance.

*Avoidable Bias*: Difference between Bayes error and Training error. 

*Variance*: Difference between Training error and dev error.
 
** Understanding Human-level Performance

Human-level error is sometimes used as a proxy for Bayes error.
Example: Medical image
a. Typical human 3%
b. Typical doctor 1%
c. Experienced doctor .7%
d. Team of experienced doctors .5%

What is "human-level" error? Bayes \leq .5%. But so long as you surpass a typical doctor, you might get away with equating human-level to the doctor's performance. 

Example. Say Training Error 5%, Dev error 6%. Human error 1/.7/.5%. Avoidable bias 4-4.5%, variance 1%. Focus on reducing bias.

But if the training error is 1%, dev error is 5%, then the variance is 4%, so focus on the variance.

If the training error is .5%, and the dev error .8%, then it really matters what you declare as human-level performance. 

