course3struct.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-26 Mo 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on Coursera, Deep Learning Specification, Structuring Machine Learning Projects, 2020</title>
<meta name="author" content="By Me" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on Coursera, Deep Learning Specification, Structuring Machine Learning Projects, 2020</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3b80822">1. Week 1 Structuring Machine Learning Projects</a>
<ul>
<li><a href="#orgaf408a0">1.1. Orthogonalization</a></li>
<li><a href="#org173b59b">1.2. Single Number Evaluation Metric</a></li>
<li><a href="#org4eb45bc">1.3. Satisficing and Optimizing Metrics</a></li>
<li><a href="#org43b0b86">1.4. Train/dev/test Distribution</a></li>
<li><a href="#orgdee4952">1.5. Size of Dev and Test Set</a></li>
<li><a href="#org44df860">1.6. When to Change dev/test sets and Metrics</a></li>
<li><a href="#orgb06e847">1.7. Why Human-level Performance?</a></li>
<li><a href="#orge5a4221">1.8. Avoidable Bias</a></li>
<li><a href="#org32f9b28">1.9. Understanding Human-level Performance</a></li>
<li><a href="#orgbe8ca72">1.10. Surpassing Human-level Performance</a></li>
<li><a href="#org7a1929c">1.11. Improving Your Model Performance</a></li>
<li><a href="#org5e0f50a">1.12. Andrej Karpathy</a></li>
</ul>
</li>
<li><a href="#orgd93fbc8">2. Week 2</a>
<ul>
<li><a href="#orgadd8f22">2.1. Error Analysis</a></li>
<li><a href="#orgcb25ff8">2.2. Cleaning up Incorrectly Labeled Examples</a></li>
<li><a href="#org272d017">2.3. Build your First System Quickly, then Iterate.</a></li>
<li><a href="#org341cbbc">2.4. Training and Testing on Different Distributions</a></li>
<li><a href="#orgd1ead16">2.5. Bias and Variance with Mismatched Data Distributions</a></li>
<li><a href="#orgebe372e">2.6. Addressing Data Mismatch</a></li>
<li><a href="#org71ac56b">2.7. Transfer Learning</a></li>
<li><a href="#orga19ceae">2.8. Multi-Task Learning</a></li>
<li><a href="#orga8aa223">2.9. End-to-End Deep Learning</a></li>
<li><a href="#org3e8cc76">2.10. Whether to Use End-to-End Deep Learning</a></li>
<li><a href="#org5f1a937">2.11. Russ Salakhutdinov</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3b80822" class="outline-2">
<h2 id="org3b80822"><span class="section-number-2">1.</span> Week 1 Structuring Machine Learning Projects</h2>
<div class="outline-text-2" id="text-1">
<p>
How best to spend your time on a project? Don&rsquo;t go off into the wrong direction!
</p>
</div>

<div id="outline-container-orgaf408a0" class="outline-3">
<h3 id="orgaf408a0"><span class="section-number-3">1.1.</span> Orthogonalization</h3>
<div class="outline-text-3" id="text-1-1">
<p>
So much stuff to tune! Good engineers know what to tune. You want to tune only in one dimension for optimal control, e.g. only speed, angle of steering etc. for a car. 
</p>

<ul class="org-ul">
<li>Fit training set well on cost function
<ul class="org-ul">
<li>Bigger network</li>
<li>Adam</li>
<li>&#x2026;</li>
</ul></li>
<li>Fit dev set well on cost function
<ul class="org-ul">
<li>Regularization</li>
<li>Bigger training set</li>
</ul></li>
<li>Fit test set well on cost function
<ul class="org-ul">
<li>Bigger dev set</li>
</ul></li>
<li>Performs well in real world
<ul class="org-ul">
<li>Change dev set or cost function</li>
</ul></li>
</ul>

<p>
Andres does not use early stopping. It is not orthogonalized - it affects both training set and dev set performance. 
</p>

<p>
How to diagnose what&rsquo;s the bottleneck to your system&rsquo;s performance?
</p>
</div>
</div>

<div id="outline-container-org173b59b" class="outline-3">
<h3 id="org173b59b"><span class="section-number-3">1.2.</span> Single Number Evaluation Metric</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A single number quickly tells whether we improve trying new things. 
</p>

<p>
Precision: TP/(FP+TP)
Recall: TP/(FN+TP)
</p>

<p>
If two classifiers don&rsquo;t agree on both metrics, what do? Maybe use F1 score: 2/(1/P + 1/R) (harmonic mean). This gives you a single number evaluation metric. 
</p>
</div>
</div>

<div id="outline-container-org4eb45bc" class="outline-3">
<h3 id="org4eb45bc"><span class="section-number-3">1.3.</span> Satisficing and Optimizing Metrics</h3>
<div class="outline-text-3" id="text-1-3">
<p>
If you have some metrics, it might be hard to press them into one single number. What helps is to have satisficing metrics, i.e. binary yes/no, only accept yes, and optimizing metrics, from which you pick the best one.
</p>

<p>
Example: trigger words for voice activation, e.g. hey google. Maximize accuracy (optimizing), in case you have at most 1 false positive every 24 hours (satisficing)
</p>
</div>
</div>

<div id="outline-container-org43b0b86" class="outline-3">
<h3 id="org43b0b86"><span class="section-number-3">1.4.</span> Train/dev/test Distribution</h3>
<div class="outline-text-3" id="text-1-4">
<p>
dev set is sometimes also called cross validation set. 
</p>

<p>
Suppose you have data from:
</p>
<ul class="org-ul">
<li>US</li>
<li>UK</li>
<li>Europe</li>
<li>South America</li>
<li>India</li>
<li>&#x2026;</li>
</ul>

<p>
Have dev and test set from the same distribution! That is, do not divide by region. Instead, randomly shuffle data first and then divide.
</p>
</div>
</div>

<div id="outline-container-orgdee4952" class="outline-3">
<h3 id="orgdee4952"><span class="section-number-3">1.5.</span> Size of Dev and Test Set</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Old way: 70/30 Train/Test, 60/20/20 Train/Dev/Test
</p>

<p>
T&rsquo;was pretty reasonable back in ye olden days with up to 10,000 training examples! But in the modern era, you have so much more training data. So you might 98/1/1 train/dev/test. 
</p>

<p>
Set you test set big enough to give high confidence in the overall performance of your system. The dev set should not be your test set! 
</p>

<p>
Train set: Learn parameters, dev set: Learn Hyperparameters, test set: Evaluate!
</p>
</div>
</div>

<div id="outline-container-org44df860" class="outline-3">
<h3 id="org44df860"><span class="section-number-3">1.6.</span> When to Change dev/test sets and Metrics</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Metric: Classification Error
</p>

<p>
Algorithm A: 3% Error, but shows pornographic images!
Algorithm B: 5% Error
</p>

<p>
\[ E = \frac{1}{m_{dev}} \sum^{m_{dev}}_{i=1} \mathcal{I}\{y^{(i)}_{pred} \not= y^{(i)}\} \]
</p>

<p>
doesn&rsquo;t cut it! Add weights \(w\):
\[w = \begin{cases}1: & x^{(i)} \text{ is non-porn } \\ 10: & x^{(i)} \text{ if non-porn}\end{cases}\]
And use instead:
\[ E = \frac{1}{\sum_i w^{(i)}} \frac{1}{m_{dev}} \sum^{m_{dev}}_{i=1} w^{(i)} \mathcal{I}\{y^{(i)}_{pred} \not= y^{(i)}\} \]
</p>

<p>
Two distinct steps:
</p>
<ol class="org-ol">
<li>Define a metric to evaluate classifiers (Place target)</li>
<li>How to do well on this metric (Aim and shoot at target)</li>
</ol>

<p>
Two completely separate problems!
</p>

<p>
Sometimes the real world application is nothing like your test/dev sets (e.g. user provided images) 
</p>
</div>
</div>

<div id="outline-container-orgb06e847" class="outline-3">
<h3 id="orgb06e847"><span class="section-number-3">1.7.</span> Why Human-level Performance?</h3>
<div class="outline-text-3" id="text-1-7">
<p>
In some areas, machines can compete with humans. Accuracy can surpass human level performance and asymptotically increase towards Bayes optimal error. Often, progress is quite fast until it hits human level performance. After that, progress slows down significantly. 
</p>

<p>
So long as ML is worse than humans, you can:
</p>
<ul class="org-ul">
<li>Get labeled data from humans</li>
<li>Gain insight from manual error analysis: why did a person get this right?</li>
<li>better analysis of bias/variance</li>
</ul>
</div>
</div>

<div id="outline-container-orge5a4221" class="outline-3">
<h3 id="orge5a4221"><span class="section-number-3">1.8.</span> Avoidable Bias</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Human level performance as a proxy Bayes optimal.
</p>

<p>
Large training error (compared to human error): Focus on reducing bias.  
Low training error (compared to human error), but larger dev error: Focus on reducing variance.
</p>

<p>
<b>Avoidable Bias</b>: Difference between Bayes error and Training error. 
</p>

<p>
<b>Variance</b>: Difference between Training error and dev error.
</p>
</div>
</div>

<div id="outline-container-org32f9b28" class="outline-3">
<h3 id="org32f9b28"><span class="section-number-3">1.9.</span> Understanding Human-level Performance</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Human-level error is sometimes used as a proxy for Bayes error.
Example: Medical image
</p>
<ol class="org-ol">
<li>Typical human 3%</li>
<li>Typical doctor 1%</li>
<li>Experienced doctor .7%</li>
<li>Team of experienced doctors .5%</li>
</ol>

<p>
What is &ldquo;human-level&rdquo; error? Bayes &le; .5%. But so long as you surpass a typical doctor, you might get away with equating human-level to the doctor&rsquo;s performance. 
</p>

<p>
Example. Say Training Error 5%, Dev error 6%. Human error 1/.7/.5%. Avoidable bias 4-4.5%, variance 1%. Focus on reducing bias.
</p>

<p>
But if the training error is 1%, dev error is 5%, then the variance is 4%, so focus on the variance.
</p>

<p>
If the training error is .5%, and the dev error .8%, then it really matters what you declare as human-level performance. 
</p>
</div>
</div>
