course3struct.org
** Surpassing Human-level Performance

Some problem areas are better for ML:

- Online advertising
- Product Recommendations (REALLY?)
- Logistics
- Loan approvals

These usually have lots of data, aren't natural perception, and enjoy structured data. 

Some
- Speech recognition
- Image recognition
- Medical recognition 
tasks perform above human-level performance. 

** Improving Your Model Performance

The two fundamental assumptions of supervised learning:
1. You can fit the training set pretty well. \rightarrow Avoidable bias
   - Train bigger model, 
   - Train longer 
   - better optimization algorithms like momentum, RMSProp, Adam, 
   - NN architecture/hyperparameters search (RNN, CNN).
2. The training set performance generalized well to dev/test set. \rightarrow Variance.
   - More data,
   - regularization, l_2, dropout etc
   - NN architecture search

** Andrej Karpathy

Unsupervised Learning hasn't delivered yet, compared to supervised learning. A lot of people are still deep believers, though! Long term future of AI? Field will split into two trajectories. First will applying stuff better and better. Second will be more Generalized AI. The divide&conquer approach of GAI seems like a wrong approach. Instead, have a Deep Learning system that's a full agent like. Other directions: from algorithmic information theory AIXI? From artificial life, artificial evolution. He thinks he has the correct answer!

It's important to understand the whole stack. Implementing it yourself helps best to go forward. NOT work with tensorflow etc at the beginning. 

* Week 2 

** Error Analysis

Manually examining the mistakes the algorithm is making can help. 

Say you algorithm has 10% overall error. Should you go forth and try to improve it on dog pictures specifically?

Error analysis:
- Get ~100 mislabeled dev set examples.
- Count how many are dogs.

  If only 5%, then the ceiling is not very high. But if 50%, then you'd halve you error with a perfect classifier. This might be worth your time!

Note the percentage of your data set of ideas for improvement you have, e.g. great cats, blurry images etc. Tend to go for larger chunks!

** Cleaning up Incorrectly Labeled Examples

*Mislabeled* examples: Your algorithm gives the wrong answer
*Incorrectly labeled examples*: The data set has it wrong

If the errors are reasonably random, it doesn't pay off to worry too much. DL is pretty robust towards those. They are less robust to systematic errors, though. For example, if white dogs tend to get classified as cats. Do something about it? Count up the percentage of incorrectly labeled examples in your mislabeled examples, then go ahead. 

Look at:
- Overall dev set error 10%
- Errors due to incorrect labels 0.6 %
- Errors due to other causes 9.4 %

In this case, probably not the best use of your time. 

Main purpose of the dev set: Choose between classifiers A and B.

If you want to manually fix up examples, use the same process in dev and test set. Consider examples the algorithm got right, too. They might be for the wrong reason. But what to fix then? Don't get it. Observe that now train and dev/test set may now come from slightly different distribution. 

Maybe it's not the most interesting thing to examine the examples, but this is something that Andrew still does himself - it can be a very good use of your time.

** Build your First System Quickly, then Iterate.
   
Example: Speech recognition.
- Noisy background
- Accented speech
- Far from microphone
- Children's speech
- Stuttering
- ...

How do you pick which to focus on? Difficult without thinking about the problem. So: Build quickly and iterate.

- Set up dev/test set and metric
- Build initial system quickly
- Use bias/variance analysis & Error analysis to prioritize next steps.

If there is a huge literature on exactly your project, then you might start with a more complicated architecture. But usually, Andrew has seen teams overthink their approach.

** Training and Testing on Different Distributions

Example: Cat App

Data from webpages (200,000) vs Data from mobile app (10,000)

Option 1: shuffle, then 205,000 train, 2,500 dev/test each. In this case, only few examples from mobile app in test/dev set. But you want to optimize for mobile app distribution. 
Option 2: train has 205,000 from the web, then additional 5,000 from mobile app. Dev and test set are both mobile app only. Andrew recommends this! You are now aiming your target to where you want it to be. Will get you better performance in the long term.

Example: Speech activated rear view mirror. 

Training: Purchased data, Smart speaker control, voice keyboard, ...: 500,000 utterances

Dev/test: Speech activated rearview mirror data, 20,000 utterances. 

Maybe take half of the speech activated utterances from the rearview mirror into the training set.

