course3struct.html

<div id="outline-container-orgbe8ca72" class="outline-3">
<h3 id="orgbe8ca72"><span class="section-number-3">1.10.</span> Surpassing Human-level Performance</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Some problem areas are better for ML:
</p>

<ul class="org-ul">
<li>Online advertising</li>
<li>Product Recommendations (REALLY?)</li>
<li>Logistics</li>
<li>Loan approvals</li>
</ul>

<p>
These usually have lots of data, aren&rsquo;t natural perception, and enjoy structured data. 
</p>

<p>
Some
</p>
<ul class="org-ul">
<li>Speech recognition</li>
<li>Image recognition</li>
<li>Medical recognition</li>
</ul>
<p>
tasks perform above human-level performance. 
</p>
</div>
</div>

<div id="outline-container-org7a1929c" class="outline-3">
<h3 id="org7a1929c"><span class="section-number-3">1.11.</span> Improving Your Model Performance</h3>
<div class="outline-text-3" id="text-1-11">
<p>
The two fundamental assumptions of supervised learning:
</p>
<ol class="org-ol">
<li>You can fit the training set pretty well. &rarr; Avoidable bias
<ul class="org-ul">
<li>Train bigger model,</li>
<li>Train longer</li>
<li>better optimization algorithms like momentum, RMSProp, Adam,</li>
<li>NN architecture/hyperparameters search (RNN, CNN).</li>
</ul></li>
<li>The training set performance generalized well to dev/test set. &rarr; Variance.
<ul class="org-ul">
<li>More data,</li>
<li>regularization, l<sub>2</sub>, dropout etc</li>
<li>NN architecture search</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org5e0f50a" class="outline-3">
<h3 id="org5e0f50a"><span class="section-number-3">1.12.</span> Andrej Karpathy</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Unsupervised Learning hasn&rsquo;t delivered yet, compared to supervised learning. A lot of people are still deep believers, though! Long term future of AI? Field will split into two trajectories. First will applying stuff better and better. Second will be more Generalized AI. The divide&amp;conquer approach of GAI seems like a wrong approach. Instead, have a Deep Learning system that&rsquo;s a full agent like. Other directions: from algorithmic information theory AIXI? From artificial life, artificial evolution. He thinks he has the correct answer!
</p>

<p>
It&rsquo;s important to understand the whole stack. Implementing it yourself helps best to go forward. NOT work with tensorflow etc at the beginning. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgd93fbc8" class="outline-2">
<h2 id="orgd93fbc8"><span class="section-number-2">2.</span> Week 2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgadd8f22" class="outline-3">
<h3 id="orgadd8f22"><span class="section-number-3">2.1.</span> Error Analysis</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Manually examining the mistakes the algorithm is making can help. 
</p>

<p>
Say you algorithm has 10% overall error. Should you go forth and try to improve it on dog pictures specifically?
</p>

<p>
Error analysis:
</p>
<ul class="org-ul">
<li>Get ~100 mislabeled dev set examples.</li>
<li><p>
Count how many are dogs.
</p>

<p>
If only 5%, then the ceiling is not very high. But if 50%, then you&rsquo;d halve you error with a perfect classifier. This might be worth your time!
</p></li>
</ul>

<p>
Note the percentage of your data set of ideas for improvement you have, e.g. great cats, blurry images etc. Tend to go for larger chunks!
</p>
</div>
</div>

<div id="outline-container-orgcb25ff8" class="outline-3">
<h3 id="orgcb25ff8"><span class="section-number-3">2.2.</span> Cleaning up Incorrectly Labeled Examples</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Mislabeled</b> examples: Your algorithm gives the wrong answer
<b>Incorrectly labeled examples</b>: The data set has it wrong
</p>

<p>
If the errors are reasonably random, it doesn&rsquo;t pay off to worry too much. DL is pretty robust towards those. They are less robust to systematic errors, though. For example, if white dogs tend to get classified as cats. Do something about it? Count up the percentage of incorrectly labeled examples in your mislabeled examples, then go ahead. 
</p>

<p>
Look at:
</p>
<ul class="org-ul">
<li>Overall dev set error 10%</li>
<li>Errors due to incorrect labels 0.6 %</li>
<li>Errors due to other causes 9.4 %</li>
</ul>

<p>
In this case, probably not the best use of your time. 
</p>

<p>
Main purpose of the dev set: Choose between classifiers A and B.
</p>

<p>
If you want to manually fix up examples, use the same process in dev and test set. Consider examples the algorithm got right, too. They might be for the wrong reason. But what to fix then? Don&rsquo;t get it. Observe that now train and dev/test set may now come from slightly different distribution. 
</p>

<p>
Maybe it&rsquo;s not the most interesting thing to examine the examples, but this is something that Andrew still does himself - it can be a very good use of your time.
</p>
</div>
</div>

<div id="outline-container-org272d017" class="outline-3">
<h3 id="org272d017"><span class="section-number-3">2.3.</span> Build your First System Quickly, then Iterate.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Example: Speech recognition.
</p>
<ul class="org-ul">
<li>Noisy background</li>
<li>Accented speech</li>
<li>Far from microphone</li>
<li>Children&rsquo;s speech</li>
<li>Stuttering</li>
<li>&#x2026;</li>
</ul>

<p>
How do you pick which to focus on? Difficult without thinking about the problem. So: Build quickly and iterate.
</p>

<ul class="org-ul">
<li>Set up dev/test set and metric</li>
<li>Build initial system quickly</li>
<li>Use bias/variance analysis &amp; Error analysis to prioritize next steps.</li>
</ul>

<p>
If there is a huge literature on exactly your project, then you might start with a more complicated architecture. But usually, Andrew has seen teams overthink their approach.
</p>
</div>
</div>

<div id="outline-container-org341cbbc" class="outline-3">
<h3 id="org341cbbc"><span class="section-number-3">2.4.</span> Training and Testing on Different Distributions</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Example: Cat App
</p>

<p>
Data from webpages (200,000) vs Data from mobile app (10,000)
</p>

<p>
Option 1: shuffle, then 205,000 train, 2,500 dev/test each. In this case, only few examples from mobile app in test/dev set. But you want to optimize for mobile app distribution. 
Option 2: train has 205,000 from the web, then additional 5,000 from mobile app. Dev and test set are both mobile app only. Andrew recommends this! You are now aiming your target to where you want it to be. Will get you better performance in the long term.
</p>

<p>
Example: Speech activated rear view mirror. 
</p>

<p>
Training: Purchased data, Smart speaker control, voice keyboard, &#x2026;: 500,000 utterances
</p>

<p>
Dev/test: Speech activated rearview mirror data, 20,000 utterances. 
</p>

<p>
Maybe take half of the speech activated utterances from the rearview mirror into the training set.
</p>
</div>
</div>
