course3struct.org
** Bias and Variance with Mismatched Data Distributions

Analyzing bias and variance changes with mismatched distrubutions.

Assume here that humans get 0% error. Let's say:

Training error 1%, Dev error 10%. If not mismatched, clear variance problem! But not with mismatched. Instead, have a training-dev set: Same distribution as training set, but not used for training. Randomly shuffle training set, carve out training-dev set. 

Training error 1%, Training-dev error 9%, Dev error 10%. Now you can see that there actually is a variance problem. The model isn't generalizing well. 

Training error 1%, Training-dev error 1.5%, Dev error 10%. Data mismatch problem! The learning algorithm can't deal too well with the new distribution. 

Training error 10%, ...: Avoidable bias problem. 

Errors summarized:
- Human level
  - \uparrow \downarrow Avoidable Bias
- Training
  - \uparrow \downarrow Variance
- Training-dev
  - \uparrow \downarrow Data mismatch
- Dev
  - \uparrow \downarrow Degree of overfitting to the dev set (get more dev set data)
- Test

More general formulation. 

|                                  | General Speech REcognition | Rearview mirror speech data |
|----------------------------------+----------------------------+-----------------------------|
| Human Level                      | Human level 4%             |                             |
| Error on examples trained on     | Training error 7%          |                             |
| Error on examples not trained on | Training-dev error 10%     | Dev/test error 6%           |

How to address data mismatch? Spoiler: no great systematic ways available. But some tricks.

** Addressing Data Mismatch
   
- Carry out manual error analysis. Understand difference between training and dev/test sets. Don't look at the test set! E.g. noisy data in dev set.
- Make training data more similar, or collect more data similar to dev/test sets. E.g. simulate noisy in-car data with artificial data synthesis.
  - If you only have little car noise, there is a chance that the model will overfit to the car noise. Careful with data synthesis! You might overfit to small subset of synthesized data. Artificial data synthesis DOES work, though! 

** Transfer Learning

Suppose you have a trained image recognizer (pre-training). You cut of the last layer and replace it with a new one. Now you train on your specific application, say radiology diagnoses (fine-tuning).

Suppose you have a speech recognition system. You want a wake-word trigger word detection system (e.g. Hey Google). Delete the last layer again, and maybe even add more than one additional layers and train again.

This makes a lot of sense if you have a lot of data for the transferred-from problem and little data for the transferred-to problem. 

Transfer from A to B makes sense if
- Task A and B have the same input x.
- You have more data for task A than task B.
- Low level features from A could be helpful for learning B.

** Multi-Task Learning
   
Suppose simplified autonomous driving example. Must detect 
- Pedestrians
- Cars
- Stop Signs
- Traffic Lights
- \dots

$$y^{(i)} = \begin{bmatrix} 1 \\ 0 \\ 0 \\ 1 \end{bmatrix}: (4,1) $$
$$Y: (4,m)$$

New Loss:

$$\mathcal{L}(\hat{y}^{(i)},y^{(i)}) = \sum_{j=1}^4 \mathcal{L} (\hat{y}^{(i)}_j,y^{(i)}_j)$$

Now you have 4 classifiers, basically. The difference to softmax regression is that a single training example can have multiple labels (last layer activation don't have to add up to 1). 

So, we are carrying out multi-task learning. You /could/ have trained four different networks. But if the tasks are similar, then this architecture might be beneficial.

Sometimes labels are missing, then you just skip those summing up the loss function.

Multi-task learning makes sense when
- Training on a set of tasks that could benefit from sharing lower-level features
- Usually: Amount of data for each task is rather similar.
- You can train a big enough neural network to do well on all the tasks.

In practive, multi-task learning is used much less often than transfer learning. The one example usually is computer vision and object detection.

** End-to-End Deep Learning

EtEDL repacles multiple computation steps with one deep neural network. 

Example: Speech recognition. 

audio \rightarrow_{MFCC} \rightarrow phonemes \rightarrow words \rightarrow transcript

audio \rightarrow transcript

For this to work, you need A LOT of data. For medium amounts of data, there are intermediate approaches. 

Example: Face recognition.

Best approach multistep. First detect a face in the image (1). Then zoom into that part of the image. Then that result if fed to an identifier neural network (2). (Basically, it is asked together with another image whether those two are the same person). Here, splitting up makes sense, since you have lots of data for sub process 1 and sub process 2, but not for the whole process.

Example: Machine translation. Here, end-to-end works quite well, since you have a lot of examples for e.g. English to French translation.

Example: Estimating child's age from X-ray of hand. Can make sense to divide up task into subtasks.

** Whether to Use End-to-End Deep Learning

Pros:
- Lets the data speak. Phonemes are an invention of linguists! 
- Less hand-design of components needed.

Cons:
- May need large amount of data
- Excludes potentially useful hand-designed components

Key question: do you have sufficient data?

** Russ Salakhutdinov

Russ was working on Restricted Boltzmann Machines as a PhD Student.
