course3struct.html

<div id="outline-container-orgd1ead16" class="outline-3">
<h3 id="orgd1ead16"><span class="section-number-3">2.5.</span> Bias and Variance with Mismatched Data Distributions</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Analyzing bias and variance changes with mismatched distrubutions.
</p>

<p>
Assume here that humans get 0% error. Let&rsquo;s say:
</p>

<p>
Training error 1%, Dev error 10%. If not mismatched, clear variance problem! But not with mismatched. Instead, have a training-dev set: Same distribution as training set, but not used for training. Randomly shuffle training set, carve out training-dev set. 
</p>

<p>
Training error 1%, Training-dev error 9%, Dev error 10%. Now you can see that there actually is a variance problem. The model isn&rsquo;t generalizing well. 
</p>

<p>
Training error 1%, Training-dev error 1.5%, Dev error 10%. Data mismatch problem! The learning algorithm can&rsquo;t deal too well with the new distribution. 
</p>

<p>
Training error 10%, &#x2026;: Avoidable bias problem. 
</p>

<p>
Errors summarized:
</p>
<ul class="org-ul">
<li>Human level
<ul class="org-ul">
<li>&uarr; &darr; Avoidable Bias</li>
</ul></li>
<li>Training
<ul class="org-ul">
<li>&uarr; &darr; Variance</li>
</ul></li>
<li>Training-dev
<ul class="org-ul">
<li>&uarr; &darr; Data mismatch</li>
</ul></li>
<li>Dev
<ul class="org-ul">
<li>&uarr; &darr; Degree of overfitting to the dev set (get more dev set data)</li>
</ul></li>
<li>Test</li>
</ul>

<p>
More general formulation. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">General Speech REcognition</th>
<th scope="col" class="org-left">Rearview mirror speech data</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Human Level</td>
<td class="org-left">Human level 4%</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Error on examples trained on</td>
<td class="org-left">Training error 7%</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Error on examples not trained on</td>
<td class="org-left">Training-dev error 10%</td>
<td class="org-left">Dev/test error 6%</td>
</tr>
</tbody>
</table>

<p>
How to address data mismatch? Spoiler: no great systematic ways available. But some tricks.
</p>
</div>
</div>

<div id="outline-container-orgebe372e" class="outline-3">
<h3 id="orgebe372e"><span class="section-number-3">2.6.</span> Addressing Data Mismatch</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Carry out manual error analysis. Understand difference between training and dev/test sets. Don&rsquo;t look at the test set! E.g. noisy data in dev set.</li>
<li>Make training data more similar, or collect more data similar to dev/test sets. E.g. simulate noisy in-car data with artificial data synthesis.
<ul class="org-ul">
<li>If you only have little car noise, there is a chance that the model will overfit to the car noise. Careful with data synthesis! You might overfit to small subset of synthesized data. Artificial data synthesis DOES work, though!</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org71ac56b" class="outline-3">
<h3 id="org71ac56b"><span class="section-number-3">2.7.</span> Transfer Learning</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Suppose you have a trained image recognizer (pre-training). You cut of the last layer and replace it with a new one. Now you train on your specific application, say radiology diagnoses (fine-tuning).
</p>

<p>
Suppose you have a speech recognition system. You want a wake-word trigger word detection system (e.g. Hey Google). Delete the last layer again, and maybe even add more than one additional layers and train again.
</p>

<p>
This makes a lot of sense if you have a lot of data for the transferred-from problem and little data for the transferred-to problem. 
</p>

<p>
Transfer from A to B makes sense if
</p>
<ul class="org-ul">
<li>Task A and B have the same input x.</li>
<li>You have more data for task A than task B.</li>
<li>Low level features from A could be helpful for learning B.</li>
</ul>
</div>
</div>

<div id="outline-container-orga19ceae" class="outline-3">
<h3 id="orga19ceae"><span class="section-number-3">2.8.</span> Multi-Task Learning</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Suppose simplified autonomous driving example. Must detect 
</p>
<ul class="org-ul">
<li>Pedestrians</li>
<li>Cars</li>
<li>Stop Signs</li>
<li>Traffic Lights</li>
<li>&hellip;</li>
</ul>

<p>
\[y^{(i)} = \begin{bmatrix} 1 \\ 0 \\ 0 \\ 1 \end{bmatrix}: (4,1) \]
\[Y: (4,m)\]
</p>

<p>
New Loss:
</p>

<p>
\[\mathcal{L}(\hat{y}^{(i)},y^{(i)}) = \sum_{j=1}^4 \mathcal{L} (\hat{y}^{(i)}_j,y^{(i)}_j)\]
</p>

<p>
Now you have 4 classifiers, basically. The difference to softmax regression is that a single training example can have multiple labels (last layer activation don&rsquo;t have to add up to 1). 
</p>

<p>
So, we are carrying out multi-task learning. You <i>could</i> have trained four different networks. But if the tasks are similar, then this architecture might be beneficial.
</p>

<p>
Sometimes labels are missing, then you just skip those summing up the loss function.
</p>

<p>
Multi-task learning makes sense when
</p>
<ul class="org-ul">
<li>Training on a set of tasks that could benefit from sharing lower-level features</li>
<li>Usually: Amount of data for each task is rather similar.</li>
<li>You can train a big enough neural network to do well on all the tasks.</li>
</ul>

<p>
In practive, multi-task learning is used much less often than transfer learning. The one example usually is computer vision and object detection.
</p>
</div>
</div>

<div id="outline-container-orga8aa223" class="outline-3">
<h3 id="orga8aa223"><span class="section-number-3">2.9.</span> End-to-End Deep Learning</h3>
<div class="outline-text-3" id="text-2-9">
<p>
EtEDL repacles multiple computation steps with one deep neural network. 
</p>

<p>
Example: Speech recognition. 
</p>

<p>
audio &rarr;<sub>MFCC</sub> &rarr; phonemes &rarr; words &rarr; transcript
</p>

<p>
audio &rarr; transcript
</p>

<p>
For this to work, you need A LOT of data. For medium amounts of data, there are intermediate approaches. 
</p>

<p>
Example: Face recognition.
</p>

<p>
Best approach multistep. First detect a face in the image (1). Then zoom into that part of the image. Then that result if fed to an identifier neural network (2). (Basically, it is asked together with another image whether those two are the same person). Here, splitting up makes sense, since you have lots of data for sub process 1 and sub process 2, but not for the whole process.
</p>

<p>
Example: Machine translation. Here, end-to-end works quite well, since you have a lot of examples for e.g. English to French translation.
</p>

<p>
Example: Estimating child&rsquo;s age from X-ray of hand. Can make sense to divide up task into subtasks.
</p>
</div>
</div>

<div id="outline-container-org3e8cc76" class="outline-3">
<h3 id="org3e8cc76"><span class="section-number-3">2.10.</span> Whether to Use End-to-End Deep Learning</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Pros:
</p>
<ul class="org-ul">
<li>Lets the data speak. Phonemes are an invention of linguists!</li>
<li>Less hand-design of components needed.</li>
</ul>

<p>
Cons:
</p>
<ul class="org-ul">
<li>May need large amount of data</li>
<li>Excludes potentially useful hand-designed components</li>
</ul>

<p>
Key question: do you have sufficient data?
</p>
</div>
</div>

<div id="outline-container-org5f1a937" class="outline-3">
<h3 id="org5f1a937"><span class="section-number-3">2.11.</span> Russ Salakhutdinov</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Russ was working on Restricted Boltzmann Machines as a PhD Student.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: By Me</p>
<p class="date">Created: 2022-09-26 Mo 16:56</p>
</div>
</body>
</html>
